     A* Copyright 2007-2026 Patrik Schindler <poc@pocnet.net>.
     A*
     A* Redistribution and use in source and binary forms, with or without
     A* modification, are permitted provided that the following conditions are
     A* met:
     A*
     A* 1. Redistributions of source code must retain the above copyright
     A*    notice, this list of conditions and the following disclaimer.
     A* 2. Redistributions in binary form must reproduce the above copyright
     A*    notice, this list of conditions and the following disclaimer in the
     A*    documentation  and/or other materials provided with the distribution.
     A*
     A* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS
     A* IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
     A* TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
     A* PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
     A* OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
     A* SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
     A* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
     A* DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
     A* THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
     A* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
     A* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
     A*
     A* This file is an example of a logical file, depending on a physical file.
     A*  it is thought as an aid for positioning a load-paged subfile with
     A*  high efficiency. Thus, for positioning backwards, we just read the key
     A*  field. For positioning forward, we only need those fields which are
     A*  referenced in the SFL.
     A* It is important to know that each record format shares the database
     A*  file pointer with each other: It is a *file* pointer, not a record-
     A*  format pointer. If we have an equal record format in the physical file
     A*  and in this logical file, we could use the PF instead of FWDPOS. But
     A*  additional code is necessary to keep file pointers in sync, which
     A*  complicates matters without need.
     A*
     A* Record Format Name -----------------------------------------------------
     A          R BCKPOS                    PFILE(V_SFLPF)
     A* Data fields
     A            KEYVAL
     A* Indexes
     A          K KEYVAL
     A*
     A* Record Format Name -----------------------------------------------------
     A          R FWDPOS                    PFILE(V_SFLPF)
     A* Data fields
     A            KEYVAL
     A            VALFLD
     A* Indexes
     A          K KEYVAL
     A* For vim ----------------------------------------------------------------
     A* vim: syntax=dds colorcolumn=81 autoindent noignorecase
