     A* Copyright 2007-2026 Patrik Schindler <poc@pocnet.net>.
     A*
     A* This file is part of a collection of templates for easy creation of
     A*  subfile-based applications on AS/400, iSeries and IBM i.
     A*
     A* Redistribution and use in source and binary forms, with or without
     A* modification, are permitted provided that the following conditions are
     A* met:
     A*
     A* 1. Redistributions of source code must retain the above copyright
     A*    notice, this list of conditions and the following disclaimer.
     A* 2. Redistributions in binary form must reproduce the above copyright
     A*    notice, this list of conditions and the following disclaimer in the
     A*    documentation  and/or other materials provided with the distribution.
     A*
     A* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS
     A* IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
     A* TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
     A* PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
     A* OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
     A* SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
     A* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
     A* DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
     A* THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
     A* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
     A* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
     A*
     A* This is an example of a Physical File. Here, actual data will be con-
     A*  tained. It may only have one record format and it serves both load-
     A*  paged and load-all subfiles equally well.
     A* It is mainly used for being read into a detail-edit screen and writing
     A*  new or changed records. To prevent duplicate primary key values, and
     A*  speeding up reading into a detail-edit screen, we *also* utilize a
     A*  key field.
     A*
     A* Globals ----------------------------------------------------------------
     A                                      UNIQUE
     A* Record Format Name -----------------------------------------------------
     A          R SFLTBL
     A* Data fields
     A            KEYVAL         4S 0
     A            VALFLD        50A
     A* Index field(s)
     A          K KEYVAL
     A* For vim ----------------------------------------------------------------
     A* vim: syntax=dds colorcolumn=81 autoindent noignorecase
